# Oracle from Python

This notebook is an introduction to reading and writing from and to an Oracle server from python. If you don't have access to an Oracle server already, then it's better to download a docker image and run it locally. To do that follow the steps below:
1. Ubuntu 20.04.3 LTS
2. Docker
3. Follow steps in this video to download Oracle Enterprise-slim docker https://www.youtube.com/watch?v=OTglm9fVCL4&t=536s
4. Oracle SQL Developer https://dev.to/ishakantony/how-to-install-oracle-sql-developer-on-ubuntu-20-04-3jpd
5. Oracle instant client https://manjaro.site/how-to-install-oracle-instant-client-on-ubuntu-20-04/
6. cx_Oracle library (pip or conda install it)


# I. Read Data from Oracle Server

In [1]:
import cx_Oracle as oc
import pandas as pd

### Define Parameters 

There are different parameters for different connections types. Here I'm just going to cover the two most common ones:
#### 1. Basic 
for a basic connection you need:
1. user
2. password
3. dsn -> points at the host and service name 'localhost/ORCLCDB.localdomain'
4. encoding, usually UTF-8

#### 2. TNS:
TNS is short for Transparent Network Substrate. It is a proprietary Oracle networking technology that supports peer-to-peer connections.
To use it you must have Oracle client installed on your machine first plus a `.ora` configuration file in `network/admin` folder.

*Refer to this for more detail on how to setup Oracle connections*  
*https://blogs.oracle.com/oraclemagazine/post/making-database-connections*

In [4]:
# basic connection parameters
basic = dict(user='c##AYMAN', password='Domain1975', dsn='localhost/ORCLCDB.localdomain', encoding='UTF-8')

# sql query
sql = 'SELECT * FROM HOUSING FETCH FIRST 1000 ROWS ONLY'

In [5]:
# '/media/ayman/Storage/ML/econometrics'
try:
    with oc.connect(**basic) as conn:
        df = pd.read_sql(sql, conn)
except oc.Error as error:
    print(error)
df.head()

,LONGITUDE,LATITUDE,HOUSING_MEDIAN_AGE,TOTAL_ROOMS,TOTAL_BEDROOMS,POPULATION,HOUSEHOLDS,MEDIAN_INCOME,MEDIAN_HOUSE_VALUE,OCEAN_PROXIMITY
0,-122.23,37.88,41,880,129.0,322,126,8.3252,452600,NEAR BAY
1,-122.22,37.86,21,7099,1106.0,2401,1138,8.3014,358500,NEAR BAY
2,-122.24,37.85,52,1467,190.0,496,177,7.2574,352100,NEAR BAY
3,-122.25,37.85,52,1274,235.0,558,219,5.6431,341300,NEAR BAY
4,-122.25,37.85,52,1627,280.0,565,259,3.8462,342200,NEAR BAY

# II. Write Data to Oracle

We need to import one additional function that will generate and engine to connect to Oracle in writing mode. And also let's get a test dataframe to write it to Oracle

In [10]:
from sqlalchemy import create_engine

In [11]:
# test dataframe we're going to write to Oracle db
filename ='test_data.parquet'

d_write = pd.read_parquet(filename)
d_write.head()

       sales  price  advert
0  73.199997   5.69     1.3
1  71.800003   6.49     2.9
2  62.400002   5.63     0.8
3  67.400002   6.22     0.7
4  89.300003   5.02     1.5

Writing pandas DataFrame to Oracle is very simple and can be done in only three steps:
1. define URI string (example below)  
`'oracle+cx_oracle://<userid>:<password>@<host>:<port>/?service_name=<servicename>'`
2. create engine using `sqlalchemy` library
3. execute `to_sql` from pandas DataFrame with the necessary args

In [24]:
uri = 'oracle+cx_oracle://C##AYMAN:Domain1975@localhost:1521/?service_name=ORCLCDB.localdomain'
conn = create_engine(uri)
d_write.to_sql('test',conn, index=False, if_exists='append')

To confirm the new file has been created, or appended to an existing one let's read it using the steps used before

In [26]:
sql2 = 'SELECT * FROM TEST'
try: 
    conn = oc.connect(**basic)
    d_read = pd.read_sql(sql2, conn)
except oc.Error as Error:
    print(Error)

d_read.size

450

**Note**:
If you are connecting to the server as SYS, which is highly NOT recommended, you need to add `mode=oc.SYSDBA` to your read connection